package com.sist.main;
/*
 * 				오버로딩				오버라이딩 => 면접 99.7%
 * 상태			한 개의 클래스 내		상속을 받은 클래스
 * 메소드			동일					동일
 * 매개 변수		다르다				동일
 * 				데이터형 / 개수	
 * 리턴형			관계 없다				동일
 * 접근지정어		관계 없다				확대(축소 -> 오류)
 * 			private < default < protected < public
 * 			
 * 	*** 상속 없이 오버라이딩 가능
 * 		=> 익명 클래스
 * 
 * 	캡슐화 => 변수 private, 메소드 public
 * 						 ------------ 읽기 / 쓰기
 * 									getter	setter
 * 	상속 => extends
 * 
 * 	다형성
 * 			오버로딩 / 오버라이딩 ******
 * 
 * 	객체 생성
 * 	클래스 객체명 = new 클래스()
 * 	상위클래스 객체명 = new 하위클래스()
 * 
 */
public class 상속_3 {

}
