/*
 * 	자바에서 지원하는 제어문
 * 		=> 프로그램의 흐름 변경 (흐름 제어)
 * 			1) 필요 시에는 건너 뛰는 프로그램을 만들 수 있다
 * 			2) 반복수행
 * 			3) 중간에 정지 : 반복제어문 => ESC
 * 	= 조건문
 * 		=> 단일 조건문
 * 			=> 마우스 클릭 / 버튼 클릭 / 상세보기
 * 		=> 선택 조건문 : true / false 를 나눠서 처리
 * 		=> 다중 조건문
 * 			=> 메뉴
 * 	= 선택문
 * 		=> switch ~ case : 값을 1 개만 선택해서 처리
 * 		=> 게임 : 키 값에 따라 처리
 * 	= 반복문
 * 		=> while
 * 		=> do ~ while
 * 		=> for
 * 	= 반복제어문
 * 		=> break
 * 		=> 특정부분을 제외 : continue
 * 
 * 	===> 배열 / 메소드
 * 	===> 객체지향 프로그램
*/
public class 자바제어문 {
	
	public static void main(String[] args) {
	
}
}
