/*
 * 	데이터 저장 ===> 데이터 활용 ===> 결과값 추출
 * 					| 연산자 / 제어문
 * 	======================		=========
 * 		모든 프로그램이 동일			  Application : 윈도우, 명령프롬프트
 * 								  Web Application : 브라우저 (HTML)
 * 								  Mobile Application : 안드로이드
 *	데이터 저장 : 한 개 / 여러 개 한 번에 저장
 *				|	  =================
 *				변수		배열 / 클래스 ===> 메모리에 저장 (휘발성)
 *				=== 
 *
 *			int a1 ~ a200;
 *
 *		변수 : 데이터를 저장하는 메모리 공간의 이름
 *							====== 숫자 (주소) => c언어 &
 *							자바의 장점 : C / C++ 에서 파생
 *										==== 어려운 부분을 제거
 *										주소 / 포인터 / 구조체
 *							=> 주소 / 포인터 => HW
 *							=> SW => 고급언어 
*/
public class 변수정리 {
	public static void main(String[] args) {
		
		
	}

}
