/*
 * 프로그램 : 설계
 * 설계
 * 	= 변수 : 데이터
 * 	= 메소드 : 기능
 * 	------------
 * 	class ==> 메모리에 저장 ==> 활용 ==> 객체 소멸
 * 				객체 / 인스턴스
 * 
 * 설계
 * class 클래스명 {
 * 		사용할 데이터 설정 : 웹 => 상세보기 => 변수
 * 		데이터 활용도 : 메소드
 * 		변수 => 데이터 수집 => 생성자, 초기화 블록
 * }
 * 
 * 메모리에 저장
 * 클래스명 객체명 = new 클래스명()
 * -----  ----	 --- 클래스 크기에 맞게 메모리 생성
 * 					 => 객체명에 생성된 주소를 넘겨준다
 * 					 new => 리턴형 => 메모리 주소(정수형)
 * 				 new => 메소드
 * 						int malloc(클래스)
 * 						------------ 메모리 저장 => 주소리턴
 * 						=> 승격 => new
 * 						=> 메모리 해제 => free() => delete
 * 												| 사용하지 않는다
 * 												| GC
 * 		  변수 => 여러 개 변수를 제어
 * 데이터형(사용자 정의)
 * 
*/
public class 클래스_7 {

}
