/*
 * 1. 클래스 구조
 * 2. 멤버 변수
 * 3. 생성자
 * 4. 메소드
 * 5. 접근지정어
 * 			
 * 6. 캡슐화
 * 7. 패키지
 * -----------------------------
 * 6장 상속 / 포함 / 클래스 종류(7장 추상클래스 / 인터페이스)
 * | 오버라이딩
 * 8장 : 예외처리
 * 9장 : java.lang / java.util(Collection)
 * 10장 : java.io / java.net / java.next
 * 	변수
 * 		= 멤버 변수 (인스턴스) : 객체 생성 시마다 메모리에 따로 저장
 * 		= 정적 변수 (static) : 메모리 공간 1 개 생성
 * 							=> 모든 객체가 공유해서 사용
 * 	형식)
 * 		멤버 변수
 * 		[접근지정어] 데이터형 변수명;
 * 		--------- 데이터 보호(정보은닉) => private
 * 		정적 변수
 * 		[접근지정어] static 데이터형 변수명;
*/

public class 객체지향_정리 {

}
