/*
 * 	데이터 저장 =======> 데이터 가공 ===========> 결과값 출력
 * 	--------		  --------					|브라우저
 * 						연산자 / 제어문				|핸드폰
 *  변수 => 묶어서 한 개 이름으로 제어					|윈도우
 *  ---------------------------------------------------
 *  관련된 데이터를 묶어서 사용 : 배열 / 클래스
 *  관련된 명령문을 묶어서 사용 : 메소드
 *  ----------------------------------- 자바의 기본 형식
 *  => 객체 지향 프로그램 (5장)
 *  배열 : 관련된 데이터를 여러 개 모아서 한 개의 이름으로 관리
 *  ----
 *  	1) 장점 => 여러 개 변수를 한 번에 처리가 가능
 *  			 ---------------------
 *  				연속적인 메모리 구조 => 메모리 크기가 동일
 *  				=> 같은 데이터형만 모아서 관리
 *  	2) 단점 => 가변형 (컬렉션) 
 *  		=> 한 번 선언하면 추가 / 삭제가 어렵다
 *  						--------> 새롭게 큰 배열을 생성
 *  						--------> 작은 배열을 생성
 *  	=> 같은 종류의 변수가 3 개 이상이면 => 배열
*/
public class 배열_1 {

}
